13/data/attachments/e7317c3a3862c954.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_3c8a0704-8b02-4096-98b0-98a5ba4016fe</nif:username>
            <nif:friendToBeAdded>Dawn_deal_Friend_35244_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>